x = input('Напишіть будь-що: ')

print('\U000025CF Третій символ рядка: ', x[2], '\n',
      '\U000025CF Перед останній символ рядка: ', x[-2],'\n',
      '\U000025CF Перші 5 символів рядка: ', x[:5], '\n',
      '\U000025CF Рядок без 2 останніх символів: ', x[:-2], '\n',
      '\U000025CF Кожен другий символ рядка: ', x[::2], '\n',
      '\U000025CF Символи рядка з непарними індексами: ', x[1::2], '\n',
      '\U000025CF Всі символи в зворотньому порядку: ', x[::-1], '\n',
      '\U000025CF Зворотній порядок через один: ', x[::-2], '\n',
      '\U000025CF Довжина рядка: ', len(x), '.', sep=''
      )